examtask/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


    xMin    0; // L = 1
    xMid    0.7;
    xMax    1;
    yMin    0; // L = 0.4
    yMid    0.3;
    yMax    0.4;
    zMin   -0.05;
    zMax    0.05;



convertToMeters 1;

vertices
(
    ($xMin $yMin $zMin)   //vertex 0
    ($xMid $yMin $zMin)   //vertex 1
    ($xMid $yMax $zMin)   //vertex 2
    ($xMin $yMax $zMin)   //vertex 3

    ($xMin $yMin $zMax)  //vertex 4
    ($xMid $yMin $zMax)  //vertex 5 
    ($xMid $yMax $zMax)  //vertex 6
    ($xMin $yMax $zMax)  //vertex 7
    
    ($xMax $yMin $zMin)  //vertex 8
    ($xMax $yMid $zMin)  //vertex 9
    ($xMax $yMin $zMax)  //vertex 10
    ($xMax $yMid $zMax)  //vertex 11
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (35 20 1) simpleGrading (1 1 1)
    hex (1 8 9 2 5 10 11 6) (15 20 1) simpleGrading (1 1 1)
    
    
   
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 3 7 4)
            
            
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (8 9 11 10)
        );
    }

    top
    {
        type wall;
        faces
        (
            (3 2 6 7)
            (2 9 11 6)
            
        );
    }
    
    bottom
    {
        type wall;
        faces
        (

            (1 5 4 0)
            (8 10 5 1)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (1 8 9 2)
            (4 5 6 7)
            (5 10 11 6)
        );
    }
);

// ************************************************************************* //
