examtask/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          20;
        startFace       1930;
    }
    outlet
    {
        type            patch;
        nFaces          20;
        startFace       1950;
    }
    top
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          50;
        startFace       1970;
    }
    bottom
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          50;
        startFace       2020;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          2000;
        startFace       2070;
    }
)

// ************************************************************************* //
