examtask/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  temperatureLaw;

nu              [0 2 -1 0 0 0 0] 5e-3; 
Pr              [0 0  0 0 0 0 0] 0.7;
Cp              [0 2 -2 -1 0 0 0] 1000;
temperatureLawCoeffs
{
	TRef	[0 0 0 1 0 0 0] 300;
	nuRef	[0 2 -1 0 0 0 0] 0.3;
	nuMin	[0 2 -1 0 0 0 0] 0.001;
	nuMax	[0 2 -1 0 0 0 0] 0.5;
	nuDeg	[0 2 -1 -1 0 0 0] 0.001;
}

// ************************************************************************* //
