examtask/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 0;

boundaryField
{
    //- Set patchGroups for constraint patches
    #includeEtc "caseDicts/setConstraintTypes"

    bottom
    {
        type            codedMixed;
        refValue        $internalField;
        refGradient     uniform 0;
    	valueFraction   uniform 1;
	
        name    atmBoundaryLayerTemperature;
        code
        #{
        const fvPatch & patch = this->patch();
        const vectorField& Cf=patch.Cf();
       
        forAll (Cf ,faceI)
        {
        	scalar x=Cf[faceI].x();
        	if((Foam::sin((constant::mathematical::pi*x)/0.1))>0)
        	{ 
        	this->refValue()[faceI]=  400;
        	this->refGrad()[faceI] = 0;//Zero;
        	this->valueFraction()[faceI] = 1.0;
        	}
        	else { 
        	this->refValue()[faceI]=  0;
        	this->refGrad()[faceI] = 0;//Zero;
        	this->valueFraction()[faceI] = 1.0;
        	}
        	}
        #};
       
         
    }
    top
    {
        type            zeroGradient;
    }
    inlet
    {
        type            fixedValue;
        value	         uniform 300;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 300;
        value           $internalField;
    }
  
}

// ************************************************************************* //
